---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAlreadyAttachedWillBeReattached
source: html/20627fa0-7917-883d-4245-7ac66df23752.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAlreadyAttachedWillBeReattached Property

The column is already attached. It will be detached and attached to the new target.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnAlreadyAttachedWillBeReattached { get; }
```